# Even more pandas

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
pd.set_option('display.float_format', '{:,.2f}'.format)
pd.set_option('display.precision',2)

## Merging data sets

In [3]:
EUurl ='http://research.stlouisfed.org/fred2/series/CPMNACSCAB1GQEU272020/downloaddata/CPMNACSCAB1GQEU272020.csv'
USurl ='http://research.stlouisfed.org/fred2/series/GDPC1/downloaddata/GDPC1.csv'

In [4]:
EU = pd.read_csv(EUurl,index_col=0, parse_dates=True)

In [5]:
US = pd.read_csv(USurl,index_col=0, parse_dates=True)

In [6]:
EU.head()

                  VALUE
DATE
1995-01-01 1,552,356.90
1995-04-01 1,570,790.80
1995-07-01 1,598,186.50
1995-10-01 1,617,057.90
1996-01-01 1,634,593.40

In [7]:
US.head()

              VALUE
DATE
1947-01-01 2,034.45
1947-04-01 2,029.02
1947-07-01 2,024.83
1947-10-01 2,056.51
1948-01-01 2,087.44

Now we want to merge the two data sets. There are three ways to do it.

1. pd.concat([dfs...])
2. pd.merge(df1, df2)
3. df1.join(df2)

### `concat`

In [8]:
# Default: axis=0, two frames are stacked on top of each other
pd.concat([US, EU])

                  VALUE
DATE
1947-01-01     2,034.45
1947-04-01     2,029.02
1947-07-01     2,024.83
1947-10-01     2,056.51
1948-01-01     2,087.44
...                 ...
2020-10-01 3,442,595.30
2021-01-01 3,472,775.40
2021-04-01 3,557,639.20
2021-07-01 3,676,729.10
2021-10-01 3,730,472.20

[408 rows x 1 columns]

In [9]:
# axis = 1: side by side
pd.concat([EU,US], axis=1)

                  VALUE     VALUE
DATE
1947-01-01          NaN  2,034.45
1947-04-01          NaN  2,029.02
1947-07-01          NaN  2,024.83
1947-10-01          NaN  2,056.51
1948-01-01          NaN  2,087.44
...                 ...       ...
2020-10-01 3,442,595.30 18,767.78
2021-01-01 3,472,775.40 19,055.65
2021-04-01 3,557,639.20 19,368.31
2021-07-01 3,676,729.10 19,478.89
2021-10-01 3,730,472.20 19,806.29

[300 rows x 2 columns]

In [10]:
names = {'VALUE':'EU_GDP'}
EU2 = EU.rename(columns=names)

In [11]:
EU2

                 EU_GDP
DATE
1995-01-01 1,552,356.90
1995-04-01 1,570,790.80
1995-07-01 1,598,186.50
1995-10-01 1,617,057.90
1996-01-01 1,634,593.40
...                 ...
2020-10-01 3,442,595.30
2021-01-01 3,472,775.40
2021-04-01 3,557,639.20
2021-07-01 3,676,729.10
2021-10-01 3,730,472.20

[108 rows x 1 columns]

In [12]:
pd.concat([US,EU2],axis=0)

              VALUE       EU_GDP
DATE
1947-01-01 2,034.45          NaN
1947-04-01 2,029.02          NaN
1947-07-01 2,024.83          NaN
1947-10-01 2,056.51          NaN
1948-01-01 2,087.44          NaN
...             ...          ...
2020-10-01      NaN 3,442,595.30
2021-01-01      NaN 3,472,775.40
2021-04-01      NaN 3,557,639.20
2021-07-01      NaN 3,676,729.10
2021-10-01      NaN 3,730,472.20

[408 rows x 2 columns]

In [13]:
pd.concat([US,EU2],axis=1)

               VALUE       EU_GDP
DATE
1947-01-01  2,034.45          NaN
1947-04-01  2,029.02          NaN
1947-07-01  2,024.83          NaN
1947-10-01  2,056.51          NaN
1948-01-01  2,087.44          NaN
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[300 rows x 2 columns]

In [14]:
# default: outer
pd.concat([US,EU2],axis=1,join='inner')

               VALUE       EU_GDP
DATE
1995-01-01 10,550.25 1,552,356.90
1995-04-01 10,581.72 1,570,790.80
1995-07-01 10,671.74 1,598,186.50
1995-10-01 10,744.20 1,617,057.90
1996-01-01 10,824.67 1,634,593.40
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[108 rows x 2 columns]

### `merge`

In [15]:
# This did not work because VALUE is the only common column name, which by default is used to join
pd.merge(US, EU)

Empty DataFrame
Columns: [VALUE]
Index: []

In [16]:
pd.merge(US, EU, on='DATE')

             VALUE_x      VALUE_y
DATE
1995-01-01 10,550.25 1,552,356.90
1995-04-01 10,581.72 1,570,790.80
1995-07-01 10,671.74 1,598,186.50
1995-10-01 10,744.20 1,617,057.90
1996-01-01 10,824.67 1,634,593.40
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[108 rows x 2 columns]

In [17]:
pd.merge(US,EU, left_index=True, right_index=True)

             VALUE_x      VALUE_y
DATE
1995-01-01 10,550.25 1,552,356.90
1995-04-01 10,581.72 1,570,790.80
1995-07-01 10,671.74 1,598,186.50
1995-10-01 10,744.20 1,617,057.90
1996-01-01 10,824.67 1,634,593.40
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[108 rows x 2 columns]

In [18]:
pd.merge(US,EU,left_on='DATE',right_on='DATE')

             VALUE_x      VALUE_y
DATE
1995-01-01 10,550.25 1,552,356.90
1995-04-01 10,581.72 1,570,790.80
1995-07-01 10,671.74 1,598,186.50
1995-10-01 10,744.20 1,617,057.90
1996-01-01 10,824.67 1,634,593.40
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[108 rows x 2 columns]

In [19]:
pd.merge(US,EU2,on='DATE')

               VALUE       EU_GDP
DATE
1995-01-01 10,550.25 1,552,356.90
1995-04-01 10,581.72 1,570,790.80
1995-07-01 10,671.74 1,598,186.50
1995-10-01 10,744.20 1,617,057.90
1996-01-01 10,824.67 1,634,593.40
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[108 rows x 2 columns]

In [20]:
US.reset_index()

          DATE     VALUE
0   1947-01-01  2,034.45
1   1947-04-01  2,029.02
2   1947-07-01  2,024.83
3   1947-10-01  2,056.51
4   1948-01-01  2,087.44
..         ...       ...
295 2020-10-01 18,767.78
296 2021-01-01 19,055.65
297 2021-04-01 19,368.31
298 2021-07-01 19,478.89
299 2021-10-01 19,806.29

[300 rows x 2 columns]

In [21]:
EU2.reset_index()

          DATE       EU_GDP
0   1995-01-01 1,552,356.90
1   1995-04-01 1,570,790.80
2   1995-07-01 1,598,186.50
3   1995-10-01 1,617,057.90
4   1996-01-01 1,634,593.40
..         ...          ...
103 2020-10-01 3,442,595.30
104 2021-01-01 3,472,775.40
105 2021-04-01 3,557,639.20
106 2021-07-01 3,676,729.10
107 2021-10-01 3,730,472.20

[108 rows x 2 columns]

In [22]:
pd.merge(US.reset_index(),EU2.reset_index())

          DATE     VALUE       EU_GDP
0   1995-01-01 10,550.25 1,552,356.90
1   1995-04-01 10,581.72 1,570,790.80
2   1995-07-01 10,671.74 1,598,186.50
3   1995-10-01 10,744.20 1,617,057.90
4   1996-01-01 10,824.67 1,634,593.40
..         ...       ...          ...
103 2020-10-01 18,767.78 3,442,595.30
104 2021-01-01 19,055.65 3,472,775.40
105 2021-04-01 19,368.31 3,557,639.20
106 2021-07-01 19,478.89 3,676,729.10
107 2021-10-01 19,806.29 3,730,472.20

[108 rows x 3 columns]

In [23]:
pd.merge(US.reset_index(),EU2.reset_index(),how='outer')

          DATE     VALUE       EU_GDP
0   1947-01-01  2,034.45          NaN
1   1947-04-01  2,029.02          NaN
2   1947-07-01  2,024.83          NaN
3   1947-10-01  2,056.51          NaN
4   1948-01-01  2,087.44          NaN
..         ...       ...          ...
295 2020-10-01 18,767.78 3,442,595.30
296 2021-01-01 19,055.65 3,472,775.40
297 2021-04-01 19,368.31 3,557,639.20
298 2021-07-01 19,478.89 3,676,729.10
299 2021-10-01 19,806.29 3,730,472.20

[300 rows x 3 columns]

### `join`

Similar to `merge`, but only allows you to use the index of the right dataframe as the join key.

In [25]:
# Almost worked, just need to disentangle the two columns named VALUE with suffices
# US.join(EU)

In [26]:
US.join(EU, lsuffix='_US', rsuffix='_EU')

            VALUE_US     VALUE_EU
DATE
1947-01-01  2,034.45          NaN
1947-04-01  2,029.02          NaN
1947-07-01  2,024.83          NaN
1947-10-01  2,056.51          NaN
1948-01-01  2,087.44          NaN
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[300 rows x 2 columns]

In [27]:
EU.join(US, lsuffix='_EU', rsuffix='_US')

               VALUE_EU  VALUE_US
DATE
1995-01-01 1,552,356.90 10,550.25
1995-04-01 1,570,790.80 10,581.72
1995-07-01 1,598,186.50 10,671.74
1995-10-01 1,617,057.90 10,744.20
1996-01-01 1,634,593.40 10,824.67
...                 ...       ...
2020-10-01 3,442,595.30 18,767.78
2021-01-01 3,472,775.40 19,055.65
2021-04-01 3,557,639.20 19,368.31
2021-07-01 3,676,729.10 19,478.89
2021-10-01 3,730,472.20 19,806.29

[108 rows x 2 columns]

In [28]:
US.join(EU2)

               VALUE       EU_GDP
DATE
1947-01-01  2,034.45          NaN
1947-04-01  2,029.02          NaN
1947-07-01  2,024.83          NaN
1947-10-01  2,056.51          NaN
1948-01-01  2,087.44          NaN
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[300 rows x 2 columns]

In [29]:
US.join(EU2, how='inner')

               VALUE       EU_GDP
DATE
1995-01-01 10,550.25 1,552,356.90
1995-04-01 10,581.72 1,570,790.80
1995-07-01 10,671.74 1,598,186.50
1995-10-01 10,744.20 1,617,057.90
1996-01-01 10,824.67 1,634,593.40
...              ...          ...
2020-10-01 18,767.78 3,442,595.30
2021-01-01 19,055.65 3,472,775.40
2021-04-01 19,368.31 3,557,639.20
2021-07-01 19,478.89 3,676,729.10
2021-10-01 19,806.29 3,730,472.20

[108 rows x 2 columns]

## Merge data with multi-index

In [30]:
US.head()

              VALUE
DATE
1947-01-01 2,034.45
1947-04-01 2,029.02
1947-07-01 2,024.83
1947-10-01 2,056.51
1948-01-01 2,087.44

In [31]:
US['country']='US'

In [32]:
US

               VALUE country
DATE
1947-01-01  2,034.45      US
1947-04-01  2,029.02      US
1947-07-01  2,024.83      US
1947-10-01  2,056.51      US
1948-01-01  2,087.44      US
...              ...     ...
2020-10-01 18,767.78      US
2021-01-01 19,055.65      US
2021-04-01 19,368.31      US
2021-07-01 19,478.89      US
2021-10-01 19,806.29      US

[300 rows x 2 columns]

In [33]:
EU['country']='EU'

In [34]:
EU

                  VALUE country
DATE
1995-01-01 1,552,356.90      EU
1995-04-01 1,570,790.80      EU
1995-07-01 1,598,186.50      EU
1995-10-01 1,617,057.90      EU
1996-01-01 1,634,593.40      EU
...                 ...     ...
2020-10-01 3,442,595.30      EU
2021-01-01 3,472,775.40      EU
2021-04-01 3,557,639.20      EU
2021-07-01 3,676,729.10      EU
2021-10-01 3,730,472.20      EU

[108 rows x 2 columns]

In [37]:
US.rename(columns={'VALUE':'GDP'},inplace=True)

In [40]:
EU.rename(columns={'VALUE':'GDP'},inplace=True)

In [38]:
US

                 GDP country
DATE
1947-01-01  2,034.45      US
1947-04-01  2,029.02      US
1947-07-01  2,024.83      US
1947-10-01  2,056.51      US
1948-01-01  2,087.44      US
...              ...     ...
2020-10-01 18,767.78      US
2021-01-01 19,055.65      US
2021-04-01 19,368.31      US
2021-07-01 19,478.89      US
2021-10-01 19,806.29      US

[300 rows x 2 columns]

In [41]:
EU

                    GDP country
DATE
1995-01-01 1,552,356.90      EU
1995-04-01 1,570,790.80      EU
1995-07-01 1,598,186.50      EU
1995-10-01 1,617,057.90      EU
1996-01-01 1,634,593.40      EU
...                 ...     ...
2020-10-01 3,442,595.30      EU
2021-01-01 3,472,775.40      EU
2021-04-01 3,557,639.20      EU
2021-07-01 3,676,729.10      EU
2021-10-01 3,730,472.20      EU

[108 rows x 2 columns]

In [42]:
gdpdata = pd.concat([US,EU])

In [43]:
gdpdata

                    GDP country
DATE
1947-01-01     2,034.45      US
1947-04-01     2,029.02      US
1947-07-01     2,024.83      US
1947-10-01     2,056.51      US
1948-01-01     2,087.44      US
...                 ...     ...
2020-10-01 3,442,595.30      EU
2021-01-01 3,472,775.40      EU
2021-04-01 3,557,639.20      EU
2021-07-01 3,676,729.10      EU
2021-10-01 3,730,472.20      EU

[408 rows x 2 columns]

In [44]:
gdpdata.reset_index(inplace=True)

In [45]:
gdpdata

          DATE          GDP country
0   1947-01-01     2,034.45      US
1   1947-04-01     2,029.02      US
2   1947-07-01     2,024.83      US
3   1947-10-01     2,056.51      US
4   1948-01-01     2,087.44      US
..         ...          ...     ...
403 2020-10-01 3,442,595.30      EU
404 2021-01-01 3,472,775.40      EU
405 2021-04-01 3,557,639.20      EU
406 2021-07-01 3,676,729.10      EU
407 2021-10-01 3,730,472.20      EU

[408 rows x 3 columns]

In [46]:
gdpdata.set_index(['country','DATE'],inplace=True)

In [47]:
gdpdata

                            GDP
country DATE
US      1947-01-01     2,034.45
        1947-04-01     2,029.02
        1947-07-01     2,024.83
        1947-10-01     2,056.51
        1948-01-01     2,087.44
...                         ...
EU      2020-10-01 3,442,595.30
        2021-01-01 3,472,775.40
        2021-04-01 3,557,639.20
        2021-07-01 3,676,729.10
        2021-10-01 3,730,472.20

[408 rows x 1 columns]

In [48]:
gdpdata.index

MultiIndex([('US', '1947-01-01'),
            ('US', '1947-04-01'),
            ('US', '1947-07-01'),
            ('US', '1947-10-01'),
            ('US', '1948-01-01'),
            ('US', '1948-04-01'),
            ('US', '1948-07-01'),
            ('US', '1948-10-01'),
            ('US', '1949-01-01'),
            ('US', '1949-04-01'),
            ...
            ('EU', '2019-07-01'),
            ('EU', '2019-10-01'),
            ('EU', '2020-01-01'),
            ('EU', '2020-04-01'),
            ('EU', '2020-07-01'),
            ('EU', '2020-10-01'),
            ('EU', '2021-01-01'),
            ('EU', '2021-04-01'),
            ('EU', '2021-07-01'),
            ('EU', '2021-10-01')],
           names=['country', 'DATE'], length=408)

In [49]:
gdpdata.loc['EU']

                    GDP
DATE
1995-01-01 1,552,356.90
1995-04-01 1,570,790.80
1995-07-01 1,598,186.50
1995-10-01 1,617,057.90
1996-01-01 1,634,593.40
...                 ...
2020-10-01 3,442,595.30
2021-01-01 3,472,775.40
2021-04-01 3,557,639.20
2021-07-01 3,676,729.10
2021-10-01 3,730,472.20

[108 rows x 1 columns]

In [50]:
gdpdata['GDP']

country  DATE
US       1947-01-01       2,034.45
         1947-04-01       2,029.02
         1947-07-01       2,024.83
         1947-10-01       2,056.51
         1948-01-01       2,087.44
                          ...
EU       2020-10-01   3,442,595.30
         2021-01-01   3,472,775.40
         2021-04-01   3,557,639.20
         2021-07-01   3,676,729.10
         2021-10-01   3,730,472.20
Name: GDP, Length: 408, dtype: float64

In [51]:
gdpdata.loc[('US','2020')]

                 GDP
DATE
2020-01-01 18,951.99
2020-04-01 17,258.21
2020-07-01 18,560.77
2020-10-01 18,767.78

### Exercise

Download unemployment rates for the US and the EU. 

* Resample the data into quarterly data.
* Merge the two dataframes into one

In [52]:
EUurl2 = 'http://research.stlouisfed.org/fred2/series/LRHUTTTTEUM156S/downloaddata/LRHUTTTTEUM156S.csv'
USurl2 = 'http://research.stlouisfed.org/fred2/series/UNRATE/downloaddata/UNRATE.csv'